bio.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Maximilien Rzepka : Clojure and Data Enthusiast</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Maximilien Rzepka : Clojure and Data Enthusiast"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-10-07T11:09+0200"/>
<meta name="author" content="Maximilien"/>
<meta name="description" content="Bio"/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="worg-classic.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Maximilien Rzepka : Clojure and Data Enthusiast</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Contact</a></li>
<li><a href="#sec-2">2000 Graduate in Mathematics (Probability) at University Paris Curie VI</a></li>
<li><a href="#sec-3">2000 - 2002 : PhD in probability University Paris Nanterre X (not completed)</a></li>
<li><a href="#sec-4">2003 - 2006 : Java/SQL Contractor in Paris</a></li>
<li><a href="#sec-5">2006 - 2013 : Programmer at Interactive Brokers in Zug</a></li>
<li><a href="#sec-6">2010 - : Clojure revolution</a></li>
<li><a href="#sec-7">2013 - : Diving into Data Science</a></li>
<li><a href="#sec-8">My Works</a></li>
<li><a href="#sec-9">Future Career</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Contact</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li><a href="#www.about.me-maxrzepka">about.me</a>
</li>
<li>@maxrzepka on <a href="https://twitter.com/maxrzepka">twitter</a>, <a href="https://github.com/maxrzepka">github</a>.
</li>
<li><a href="http://www.linkedin.com/pub/maximilien-rzepka/64/43/947">linkedIn</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">2000 Graduate in Mathematics (Probability) at University Paris Curie VI</h2>
<div class="outline-text-2" id="text-2">


<p>
I started my education in pure math in Paris VI. But I found pure math very dry.
I found it difficult to decide which direction to go in for my PhD.
I needed something more applied.
</p>
<p>
I chose Geography : looking at maps, understanding how the world is turning around is the most natural thing for me.
Just one month after starting, we were sent out in the field (Forêt de Fontainebleau studying stampian sand)
By choosing Geography, I came across new horizons such as Statistics and Unix operating systems.
</p>
<p>
I went back to math, but this time more applied : statistics and probability.
</p>
<p>
I did a trainership at INRIA Sophia-Antipolis and enjoyed my first programming experience with C and pointers.
The algorithm I developed detects roads from satellite maps.
It was fairly fast, but lacked of well-grounded mathematical proof.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">2000 - 2002 : PhD in probability University Paris Nanterre X (not completed)</h2>
<div class="outline-text-2" id="text-3">


<p>
In the meantime I was offered a scholarship for a PhD in probability in Paris.
After one year I realized that it would not work out as the material was too pure.
I was more interested in Computer Science but I could not find a bridge between the fields.
</p>
<p>
However I did get the opportunity to do some teaching and it was a really great experience :
The best way to learn is by teaching.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">2003 - 2006 : Java/SQL Contractor in Paris</h2>
<div class="outline-text-2" id="text-4">


<p>
After a 2 months Java/SQL training, I started a new career inside the enterprise IT world.
My missions were in Java, SQL, Oracle. Most projects were built on the three-tier architecture (mostly web-apps).
</p>
<p>
Some projects were using more "advanced" frameworks like Hibernate, Struts.
I also always kept a personal interest for the Unix world (vi,awk, perl and co).
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">2006 - 2013 : Programmer at Interactive Brokers in Zug</h2>
<div class="outline-text-2" id="text-5">


<p>
My role was to collect data in order to build reports and more advanced web based applications to ease employee work.
The technologies in place were restricted : Perl, PHP , Java (Spring, JSF) , Javascript , Oracle/MySQL, still in a complete Unix environment.
</p>
<p>
This long period in a stable environment allowed me to try new ideas and to find solutions to my day-to-day issues :
</p><ul>
<li>Code generation to write boilerplate code in various languages.
</li>
<li>Web development in java with Spring and JSF.
</li>
<li>Web User Interface in Javascript with JQuery.
</li>
<li>Scripting tools : awk , perl&hellip;
</li>
</ul>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">2010 - : Clojure revolution</h2>
<div class="outline-text-2" id="text-6">


<p>
I discovered Clojure in 2010 and slowly entered the world of data and functions, paradigms that are for me easy to grasp.
</p>
<p>
I got really enthusiastic about this functional language thanks to Rich Hickey and Stuart Halloway's Talks :
The clojure version of The bowling scorer <a href="https://github.com/stuarthalloway/clojure-bowling/blob/master/src/bowling_game.clj">bowling<sub>game</sub>.clj</a> done by Stuart Halloway's convinced me about the simplicity of Clojure.
</p>
<p>
"hammock-driven dev" , "data and functions" and other clojure values appealed strongly to me.
But I had still a long way to go.
</p>
<p>
I missed <a href="http://clj-me.cgrand.net/">Christophe Grand</a> a clojure core contributor at the first MIX-it (May 2011) in Lyon
but I found another clojure enthusiast from Geneva <a href="http://www.linkedin.com/pub/stephane-tavera/1/652/3b">Stephane Tavera</a> who initiated the Clojure Geneva User Group, whose meetups I attended.
</p>
<p>
Then I met finally @cgrand at Geneva Soft Shake (Sep 2011) and also another clojurian <a href="http://mpenet.github.io/">Max Penet</a>.
I had great discussions with both of them : their open-mindness, independence and demanding nature guided me.
</p>
<p>
In 2012 I followed Grand's training in Geneva based on his book "Clojure Programming" and he showed me the path towards simplicity.
</p>
<p>
Then <a href="http://tgk.github.io/">Thomas Kristensen</a> came to Zürich and we started weekly informal clojure meetups then we founded the <a href="http://www.meetup.com/zh-clj-Zurich-Clojure-User-Group/">Zürich Clojure User Group</a>.
</p>
<p>
Teaching/sharing is very important for me. 
Today within our large clojure community, I'm organizing talks for the Clojure Zürich User Group.
</p>
<p>
Meanwhile, I deliberately travelled to meet other programmers : 
<a href="http://euroclojure.com/2012/">EuroClojure 2012</a>, <a href="http://clojurewest.org/">Clojure/West March 2013</a>, <a href="http://skillsmatter.com/event/scala/clojure-exchange-2012">Clojure Exchange Dec 2012,</a> <a href="http://www.meetup.com/riviera-scala-clojure/">Riviera Scala Clojure</a> and various meetups in Switzerland. 
It's a great source of inspiration and motivation.
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">2013 - : Diving into Data Science</h2>
<div class="outline-text-2" id="text-7">

<p>I passed the <a href="http://university.cloudera.com/certification/CCP/DS-200.html">Cloudera Data Science essentials DS200 (Beta)</a> exam in May
2013 and now I'm preparing the <a href="http://university.cloudera.com/certification/CCP/2013_challenge01.html">Data Science Challenge</a>.
This program encompasses :
</p><ul>
<li>Hadoop Full Stack (Streaming, Hive, Pig&hellip;)
</li>
<li>Machine Learning (Clustering, Classification&hellip;)
</li>
</ul>



<p>   
Then I attended to the BigDive June 2013 in Torino (Italy) a <a href="http://www.bigdive.eu/program/">Full-stack Data Science Training</a> :
</p>
<ul>
<li>Visualization with D3js by <a href="http://www.todo.to.it/">todo.to</a>
</li>
<li>Network Science by <a href="http://www.isi.it/">ISI team</a>
</li>
<li>Python Dev by <a href="http://www.axant.it/">Axant.it</a>
</li>
<li>MapReduce with <a href="https://github.com/Yelp/mrjob/">MrJob</a> by @irskep
</li>
<li>Machine Learning by <a href="http://www.isi.it/">ISI team</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">My Works</h2>
<div class="outline-text-2" id="text-8">

<ul>
<li>Clojure Educational Projects : 
<ul>
<li><a href="https://github.com/maxrzepka/drama/">Drama</a> : scrape/query/diplay data with ring, enlive, cascalog.
</li>
<li><a href="https://github.com/maxrzepka/clojure-by-example">ClojureByExample</a> : discover clojure APIs with examples.
</li>
</ul>

</li>
<li><a href="https://github.com/maxrzepka/dataQuery">Data Query</a> : query abstraction on top of cascalog and SQL. Beta Version on <a href="https://bitbucket.org/maxrzepka/cube">bitbucket</a>.
</li>
<li>Article <a href="http://maxrzepka.github.io/data-analysis-explained.html">Data Analysis Explained While Kaggling</a>.
</li>
<li>Piedmont Heritage : open data project made @ <a href="http://www.bigdive.eu/final-projects/">BigDive</a>.
</li>
<li>Talk "Clojure and Data : Introduction to Data Science" @ <a href="http://soft-shake.ch/2013/program/sessions/13_fun_prog/2013/10/24/01-Clojure-and-Data-introduction-to-datascience.html">soft-shake</a> 24th October 2013.
</li>
</ul>


</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">Future Career</h2>
<div class="outline-text-2" id="text-9">


<p>
I'm very excited about the new challenges in Computer Science 
and bring along math my first passion to help addressing them. 
</p>
<p>
Thanks to bigdive 2013, I now enjoy working in Data Science fields.
</p>
<p>
I know that my future will be a mixture of programming, math and data, where knowledge/ideas can travel without friction.
</p>
<p>
I have plenty of ideas and my curiosity can be endless. I'm looking forward sharing my enthusiasm with others.
</p></div>
</div>
</div>

<div id="postamble">
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
